{
    "status": "ok",
    "totalResults": 8184,
    "articles": [
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "decrypt.co",
    "title": "Robert F. Kennedy Jr. Silent on Bitcoin and CBDC During Twitter Talk with Elon Musk",
    "description": "Tesla CEO and Twitter owner Elon Musk hosted a conversation with presidential candidate Robert F. Kennedy Jr on Monday. And while it lasted for more than two hours, Bitcoin and the digital assets industry never came up. The chit-chat between the two, moderate…",
    "url": "https://biztoc.com/x/624ac8626815a248",
    "urlToImage": "https://c.biztoc.com/p/624ac8626815a248/s.webp",
    "publishedAt": "2023-06-06T07:44:08Z",
    "content": "Tesla CEO and Twitter owner Elon Musk hosted a conversation with presidential candidate Robert F. Kennedy Jr on Monday. And while it lasted for more than two hours, Bitcoin and the digital assets ind… [+294 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Gadgets360.com"
    },
    "author": "Reuters",
    "title": "China Plans to Initiate AI Regulations, Says Elon Musk After Meeting With Officials",
    "description": "The Chinese government will seek to initiate artificial intelligence regulations in its country, billionaire Elon Musk said on Monday after meeting with officials during his recent trip to China. \"It's worth noting that on my recent trip to China, I went to s…",
    "url": "https://www.gadgets360.com/internet/news/elon-musk-china-initiate-ai-artificial-intelligence-regulation-meeting-officials-4098166",
    "urlToImage": "https://i.gadgets360cdn.com/large/ai_reuters_1_1685602415597.jpg",
    "publishedAt": "2023-06-06T07:36:39Z",
    "content": "The Chinese government will seek to initiate artificial intelligence regulations in its country, billionaire Elon Musk said on Monday after meeting with officials during his recent trip to China.\r\nMu… [+2428 chars]"
    },
    {
    "source": {
    "id": "independent",
    "name": "Independent"
    },
    "author": "Robert Waugh",
    "title": "He fled Ukraine under the barrel of a gun. Now his invention could turn the tide of Putin’s war",
    "description": "Gene Avakyan knows what it’s like to grow up during times of tension, Robert Waugh writes",
    "url": "https://www.independent.co.uk/news/world/europe/ukraine-military-news-today-b2352113.html",
    "urlToImage": "https://static.independent.co.uk/2023/05/29/10/newFile-4.jpg?quality=75&width=1200&auto=webp",
    "publishedAt": "2023-06-06T06:54:27Z",
    "content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nAn aerospace engineer and entrepreneur who left the … [+5738 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "medium.datadriveninvestor.com",
    "title": "Why Warren Buffett’s Advice To Invest Into An S&P 500 Index Fund Is So Powerful For Growing Money",
    "description": "If I rewind time and go back to 2017, I would see a version of me that was super passionate about tech, particularly the hardware aspect of things. Three things were on my mind while doing my stock investment project: building a computer, buying a phone, and …",
    "url": "https://biztoc.com/x/dc66284707a1cad8",
    "urlToImage": "https://c.biztoc.com/p/dc66284707a1cad8/s.webp",
    "publishedAt": "2023-06-06T06:46:16Z",
    "content": "If I rewind time and go back to 2017, I would see a version of me that was super passionate about tech, particularly the hardware aspect of things.Three things were on my mind while doing my stock in… [+239 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "medium.datadriveninvestor.com",
    "title": "The Future of Autonomous Flying Through the Metaverse",
    "description": "The metaverse, a collective virtual shared space where the physical and the digital worlds converge, is an ever-evolving platform for interaction, collaboration, and exploration. Recently, Tullio Siragusa conducted an enlightening discussion with Diana Deca, …",
    "url": "https://biztoc.com/x/4b7c599ab866528d",
    "urlToImage": "https://c.biztoc.com/p/4b7c599ab866528d/s.webp",
    "publishedAt": "2023-06-06T06:18:13Z",
    "content": "The metaverse, a collective virtual shared space where the physical and the digital worlds converge, is an ever-evolving platform for interaction, collaboration, and exploration. Recently, Tullio Sir… [+260 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Digitimes"
    },
    "author": "DIGITIMES",
    "title": "Panasonic reportedly to grow EV battery production in Nevada",
    "description": "Tesla battery supplier Panasonic has made another move to scale up in the US. The company reportedly plans to set up a new battery production line in Gigafactory Nevada, which will likely increase output by 10%.",
    "url": "https://www.digitimes.com/news/a20230606VL205/panasonic-tesla-united-states-ev-battery.html&chid=10",
    "urlToImage": "https://img.digitimes.com/newsshow/20230606vl205_files/2_2b.jpg",
    "publishedAt": "2023-06-06T06:09:17Z",
    "content": "Save my User ID and Password\r\nSome subscribers prefer to save their log-in information so they do not have to enter their User ID and Password each time they visit the site. To activate this function… [+307 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Insurance Journal"
    },
    "author": "Admin",
    "title": "Lawsuit Claiming Racism at Tesla Draws Almost 240 Black Workers Saying ‘Me Too’",
    "description": "A Black former assembly line staffer at Tesla Inc. is moving to add hundreds of other workers to his 2017 lawsuit in which he called the electric-car maker’s production floor a “hotbed for racist behavior.” Marcus Vaughn says class-action status …",
    "url": "https://www.insurancejournal.com/news/national/2023/06/06/724172.htm",
    "urlToImage": "https://www.insurancejournal.com/app/uploads/2023/06/Tesla-plant2-Bloomberg-scaled.jpg",
    "publishedAt": "2023-06-06T06:00:56Z",
    "content": "New You can now listen to Insurance Journal articles!A Black former assembly line staffer at Tesla Inc. is moving to add hundreds of other workers to his 2017 lawsuit in which he called the electric-… [+2789 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory by 10%",
    "description": "(marketscreener.com) Panasonic Holdings plans to expand production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla by 10% within three years, a spokesperson for the Japanese company said on Tuesday.https://www.marketscreener.c…",
    "url": "https://www.marketscreener.com/quote/stock/PANASONIC-HOLDINGS-CORPOR-6492473/news/Panasonic-to-boost-battery-output-at-Tesla-s-Nevada-Gigafactory-by-10-44043526/?utm_medium=RSS&utm_content=20230606",
    "urlToImage": "https://img.zonebourse.com/reuters/2023-06/2023-06-05T220000Z_1_LYNXMPEJ540W1_RTROPTP_3_PANASONIC-CEO.JPG",
    "publishedAt": "2023-06-06T05:27:04Z",
    "content": "The comments followed a Nikkei Asia report on Monday that said unit Panasonic Energy would install a 15th production line at Gigafactory Nevada.\r\nPanasonic Energy announced the plan to increase the N… [+1146 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "watcher.guru",
    "title": "Dogecoin Renews Bearish Streak: Network Scaling Down?",
    "description": "Last week, Elon Musk was accused of insider trading and price manipulation by investors in a Dogecoin lawsuit. In a recent filing in Manhattan federal court, investors asserted that Musk allegedly paid online influencers, appeared on SNL, and used Twitter pos…",
    "url": "https://biztoc.com/x/82faac081ce5178c",
    "urlToImage": "https://c.biztoc.com/p/82faac081ce5178c/s.webp",
    "publishedAt": "2023-06-06T05:14:04Z",
    "content": "Last week, Elon Musk was accused of insider trading and price manipulation by investors in a Dogecoin lawsuit. In a recent filing in Manhattan federal court, investors asserted that Musk allegedly pa… [+282 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "EURACTIV"
    },
    "author": "Nick Alipour",
    "title": "German economy at risk as companies plan to leave country",
    "description": "A growing number of businesses are moving jobs and production abroad, with many others considering taking concrete measures, a study by the Federation of German Business (BDI) found, as concerns about the German economy continue to grow. While 16% of...",
    "url": "https://www.euractiv.com/section/politics/news/german-economy-at-risk-as-companies-plan-to-leave-country/",
    "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2023/06/lead-3-800x450.png",
    "publishedAt": "2023-06-06T04:31:02Z",
    "content": "A growing number of businesses are moving jobs and production abroad, with many others considering taking concrete measures, a study by the Federation of German Business (BDI) found, as concerns abou… [+2395 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "NDTV News"
    },
    "author": null,
    "title": "Why Are Electric Car Names So Bad? Here Are The Worst",
    "description": "The chance to name a new car is precious, a billion-dollar branding exercise with decades of potential staying power.",
    "url": "https://www.ndtv.com/world-news/why-are-electric-car-names-so-bad-here-are-the-worst-4097633",
    "urlToImage": "https://c.ndtvimg.com/2020-01/rk62jdvo_hyundai-electric-car_650x400_03_January_20.jpg",
    "publishedAt": "2023-06-06T04:19:20Z",
    "content": "A car's name may also matter less to consumers than its price tag, range, features and aesthetic\r\nThe chance to name a new car is precious, a billion-dollar branding exercise with decades of potentia… [+4990 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "The Straits Times"
    },
    "author": "cue",
    "title": "Lawsuit Claiming Racism at TESLA Draws Almost 240 Black Workers Saying 'Me Too'...",
    "description": "Lawsuit Claiming Racism at TESLA Draws Almost 240 Black Workers Saying 'Me Too'...\r\n\n \n \n \n (Second column, 12th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:TWITTER Ad Sales Plunge 59% as Woes Continue...\r\nChild Sex Abuse Material Still Found On Site...",
    "url": "https://www.straitstimes.com/business/lawsuit-claiming-racism-at-tesla-draws-almost-240-black-workers",
    "urlToImage": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/06/06/2023-03-27T100025Z1707721703RC2920AIFU6CRTRMADP3TESLA-TRIAL_1.JPG?VersionId=bLobFo2X4Z4x9ffbCZERYGYlKXwMSPdA",
    "publishedAt": "2023-06-06T04:04:37Z",
    "content": "NEW YORK - A black former assembly line staffer at Tesla is moving to add almost 240 other workers to his 2017 lawsuit in which he called the electric car makers production floor a hotbed for racist … [+2387 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Tina Casey",
    "title": "Home Energy Storage Is Getting A Flow Battery Makeover",
    "description": "There they go again: Georgia's premier public university readies new flow battery for the red-hot home energy storage market.",
    "url": "https://cleantechnica.com/2023/06/05/home-energy-storage-is-getting-a-flow-battery-makeover/",
    "urlToImage": "https://cleantechnica.com/files/2023/06/flow-battery-residential-energy-storage-georgia-tech.jpg",
    "publishedAt": "2023-06-06T03:50:40Z",
    "content": "The cost of home energy storage is continuing to drop, with lithium-ion batteries dominating the market. If the trend continues, it won’t be long before whole-house battery packs are as common as  re… [+8859 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Daily Mail"
    },
    "author": "Andrew Brown",
    "title": "Man alleged to have stolen Nick Kyrgios' car from his mother at gunpoint pleads not guilty",
    "description": "The man accused of stealing the car at gunpoint has been charged with alleged aggravated robbery and failing to stop for police, among other alleged offences.",
    "url": "https://www.dailymail.co.uk/sport/tennis/article-12163421/Man-alleged-stolen-Nick-Kyrgios-car-mother-gunpoint-pleads-not-guilty.html",
    "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/06/04/71805527-0-image-a-11_1686023033877.jpg",
    "publishedAt": "2023-06-06T03:49:40Z",
    "content": "The man accused of stealing Nick Kyrgios's car from the tennis star's mother at gunpoint has pleaded not guilty over the incident.\r\nThe man, who is not being named for legal reasons, entered a not gu… [+1244 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Guest Contributor",
    "title": "Broken Record: Atmospheric Carbon Dioxide Levels Jump Again",
    "description": "Carbon dioxide levels measured at NOAA’s Mauna Loa Atmospheric Baseline Observatory peaked at 424 parts per million in May, continuing a steady climb further into territory not seen for millions of years, scientists from NOAA and Scripps Institution of Oceano…",
    "url": "https://cleantechnica.com/2023/06/05/broken-record-atmospheric-carbon-dioxide-levels-jump-again/",
    "urlToImage": "http://cleantechnica.com/files/2023/06/PHOTO-Air-intake-tube-Maunakea-Observatories-Hawaii-120822-NOAA-e1686022960754-800x492.jpg",
    "publishedAt": "2023-06-06T03:42:57Z",
    "content": "Carbon dioxide levels measured at NOAAs Mauna Loa Atmospheric Baseline Observatory peaked at 424 parts per million in May, continuing a steady climb further into territory not seen for millions of ye… [+7017 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Zachary Shahan",
    "title": "More Investment In Solar Than Oil In 2023",
    "description": "When I started writing on CleanTechnica in 2009, we were often writing about solar power. It was a hot, fast-growing industry. It was exploding and forecasts for it were enormous. Yet, investments in solar power were nowhere close to investments in oil, and a…",
    "url": "https://cleantechnica.com/2023/06/05/more-investment-in-solar-than-in-oil-in-2023/",
    "urlToImage": "http://cleantechnica.com/files/2023/06/clean-energy-vs-fossil-fuels-IEA-investment.png",
    "publishedAt": "2023-06-06T03:34:18Z",
    "content": "When I started writing on CleanTechnica in 2009, we were often writing about solar power. It was a hot, fast-growing industry. It was exploding and forecasts for it were enormous. Yet, investments in… [+5174 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Moneycontrol"
    },
    "author": "New York Times",
    "title": "Is the Bear Market over? It depends",
    "description": "The index fluctuated around the threshold on Monday, moving above it multiple times, before ending 0.2% lower for the day, which put it at 19.5% above its October low.",
    "url": "https://www.moneycontrol.com/news/world/is-the-bear-market-over-it-depends-10748511.html",
    "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Markets-Bull-Bear-770x433.jpg",
    "publishedAt": "2023-06-06T03:19:08Z",
    "content": "The S&amp;P 500, the index obsessed over by investors, executives and government officials, on Monday came close to finishing 20% above its lowest level of 2022, a gain that some on Wall Street see a… [+5285 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Erickimphotography.com"
    },
    "author": "ERIC KIM",
    "title": "PURSUE YOUR PASSION",
    "description": "It doesn’t matter how “rational” or “irrational” it is. Also ignore the money-making capabilities; you can figure out those small details later as need comes. Ignore “market need”, or even nonsensical notions of “product market fit”— ignore all this nonsensic…",
    "url": "https://erickimphotography.com/blog/2023/06/05/pursue-your-passion-3/",
    "urlToImage": "https://i0.wp.com/erickimphotography.com/blog/wp-content/uploads/2023/06/cropped-IMG_1890.jpg?fit=512%2C512&ssl=1",
    "publishedAt": "2023-06-06T03:12:08Z",
    "content": "It doesnt matter how rational or irrational it is. Also ignore the money-making capabilities; you can figure out those small details later as need comes.\r\nIgnore market need, or even nonsensical noti… [+253 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Cointelegraph"
    },
    "author": "Cointelegraph By Jesse Coghlan",
    "title": "Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC",
    "description": "With its latest suit against Binance, the U.S. SEC has now labeled at least 61 cryptocurrencies as securities, affecting $100 billion worth of tokens on the market.",
    "url": "https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit",
    "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2023-06/112d034a-1452-4f93-8e88-c12beb0a850e.jpg",
    "publishedAt": "2023-06-06T03:03:32Z",
    "content": "The total number of cryptocurrencies the United States securities regulator has accused to be a security has now reached an estimated 61, after adding a few more from its lawsuit against crypto excha… [+3380 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Moneycontrol"
    },
    "author": "Bloomberg",
    "title": "Chinese unicorn claims breakthrough with all-weather EV battery",
    "description": "Greater Bay Technology says its new Phoenix cell is made with superconducting materials and contains thermal management technology that can heat the battery back from -4F to 77F in five minutes.",
    "url": "https://www.moneycontrol.com/news/world/chinese-unicorn-claims-breakthrough-with-all-weather-ev-battery-10748421.html",
    "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/398991090-770x433.jpg",
    "publishedAt": "2023-06-06T03:00:47Z",
    "content": "A Chinese battery startup claims to have overcome one of the key sticking points for electric car owners the loss of power capability and range in cold climates.\r\nGreater Bay Technology says its new … [+2403 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "VOA News"
    },
    "author": "webdesk@voanews.com (Agence France-Presse)",
    "title": "Musk Says China Detailed Plans to Regulate AI",
    "description": "Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech billionaire said Monday, in his first comments on the two-day visit.\n\n\nThe Twitter owner and Tesla CEO — one …",
    "url": "https://www.voanews.com/a/musk-says-china-detailed-plans-to-regulate-ai-/7124584.html",
    "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-e38f-08db6637fb31_w1200_r1.jpg",
    "publishedAt": "2023-06-06T02:54:29Z",
    "content": "Washington  Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech billionaire said Monday, in his first… [+2490 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "businessinsider.com",
    "title": "Companies are using Twitter's own tools to keep their ads away from Elon Musk's tweets",
    "description": "Twitter CEO Elon Musk appearing at a 2022 Tesla event. Suzanne Cordeiro/AFP via Getty Images Elon Musk told the BBC in April that \"almost all advertisers have come back to Twitter.\" Ad revenue from April 1 to the first week of May was down 59% from a year ear…",
    "url": "https://biztoc.com/x/790114f5144d31e7",
    "urlToImage": "https://c.biztoc.com/p/790114f5144d31e7/s.webp",
    "publishedAt": "2023-06-06T02:54:05Z",
    "content": "Twitter CEO Elon Musk appearing at a 2022 Tesla event.Suzanne Cordeiro/AFP via Getty ImagesElon Musk told the BBC in April that \"almost all advertisers have come back to Twitter.\"Ad revenue from Apri… [+308 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "The Guardian"
    },
    "author": "Australian Associated Press",
    "title": "Man accused of stealing Nick Kyrgios’s Tesla at gunpoint pleads not guilty",
    "description": "A Canberra court has heard the man accused of stealing Nick Kyrgios’s car from his mother at gunpoint has pleaded not guilty<ul><li>Follow our Australia news live blog for the latest updates</li><li>Get our morning and afternoon news emails, free app or daily…",
    "url": "https://www.theguardian.com/sport/2023/jun/06/nick-kyrgios-green-tesla-man-accused-of-stealing-car-at-gunpoint-pleads-not-guilty",
    "urlToImage": "https://i.guim.co.uk/img/media/10ee6837815d042f4859b9ac434b37bb65e13232/0_0_5617_3371/master/5617.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a03b4442d812a1c7fb470d196983c08",
    "publishedAt": "2023-06-06T02:22:04Z",
    "content": "The man accused of stealing Nick Kyrgioss car from the tennis stars mother at gunpoint has pleaded not guilty over the incident.\r\nThe man, who is not being named for legal reasons, entered a not guil… [+6186 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "NDTV News"
    },
    "author": null,
    "title": "\"Tesla Hotbed For Racism\": Lawsuit Claims 6,000 Workers Faced Discrimination",
    "description": "A Black former assembly line staffer at Tesla Inc. is moving to add hundreds of other workers to his 2017 lawsuit in which he called the electric-car maker's production floor a \"hotbed for racist behavior.\"",
    "url": "https://www.ndtv.com/world-news/tesla-hotbed-for-racism-lawsuit-claims-6-000-workers-faced-discrimination-4097497",
    "urlToImage": "https://c.ndtvimg.com/2022-02/jlmbg32g_musk-bloomberg_625x300_24_February_22.jpg",
    "publishedAt": "2023-06-06T02:18:05Z",
    "content": "If a judge in agrees to broaden the case, it would raise the stakes for Elon Musk's company. (File)\r\nA Black former assembly line staffer at Tesla Inc. is moving to add hundreds of other workers to h… [+2721 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "cnbc.com",
    "title": "Cramer says it's still a bull market, but trim a few tech stocks and profit while you can",
    "description": "CNBC's Jim Cramer told investors on Monday to trim their tech stock and enjoy some of the fruits of their labor while they still can. \"Unless you're terminally greedy or totally brain-dead, you take some profits while you have them,\" Cramer said. \"This is not…",
    "url": "https://biztoc.com/x/8f08f9f842f8d9d9",
    "urlToImage": "https://c.biztoc.com/p/8f08f9f842f8d9d9/og.webp",
    "publishedAt": "2023-06-06T02:10:07Z",
    "content": "CNBC's Jim Cramer told investors on Monday to trim their tech stock and enjoy some of the fruits of their labor while they still can.\"Unless you're terminally greedy or totally brain-dead, you take s… [+284 chars]"
    },
    {
    "source": {
    "id": "the-times-of-india",
    "name": "The Times of India"
    },
    "author": "Reuters",
    "title": "US stock market: S&P 500 ends lower as traders eye potential pause in rate hikes",
    "description": "Apple Inc ended 0.8% lower after the world's most valuable company unveiled an augmented-reality headset called the Vision Pro, its riskiest and biggest bet since the introduction of the iPhone. Earlier Apple rose as much as 2.2% to an all-time high.",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-market-sp-500-ends-lower-as-traders-eye-potential-pause-in-rate-hikes/articleshow/100779624.cms",
    "urlToImage": "https://img.etimg.com/thumb/msid-100779652,width-1070,height-580,imgsize-105150,overlay-etmarkets/photo.jpg",
    "publishedAt": "2023-06-06T02:03:45Z",
    "content": "June 5 : The S&amp;P 500 ended lower on Monday as investors weighed whether the U.S. Federal Reserve might pause its interest rate hikes at its upcoming policy meeting, while Apple briefly hit a reco… [+2923 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Daily Mail"
    },
    "author": "Neirin Gray Desai",
    "title": "Pizza delivery service Zume that would cook the pies on the way to your house folds",
    "description": "A Silicon Valley startup that planned to use robots to make pizzas in the back of delivery trucks has gone bust after raising $445million in funding.",
    "url": "https://www.dailymail.co.uk/news/article-12162897/Pizza-delivery-service-Zume-cook-pies-way-house-folds.html",
    "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/06/01/71801661-0-image-a-17_1686012567368.jpg",
    "publishedAt": "2023-06-06T01:51:46Z",
    "content": "A Silicon Valley startup that planned to use robots to make pizzas in the back of delivery trucks has gone bust after raising $445million in funding.\r\nZume, founded in 2015, sought to disrupt the piz… [+3327 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "MarketWatch"
    },
    "author": "Joy Wiltermuth",
    "title": "As major tech stocks head for the moon, investors drain $77.5 billion from equity funds",
    "description": "Even as major tech stocks touch new highs for 2023, investors are fleeing equity funds in favor of fixed-income alternatives, according to LSEG Lipper data.",
    "url": "https://www.marketwatch.com/story/as-major-tech-stocks-head-for-the-moon-investors-drain-77-5-billion-from-equity-funds-f97e483b",
    "urlToImage": "https://images.mktw.net/im-794789/social",
    "publishedAt": "2023-06-06T01:49:00Z",
    "content": "A small group of technology stocks may be powering the stock market higher, but investors have continued fleeing equity funds in the first five months of 2023 in favor of fixed-income alternatives, a… [+2691 chars]"
    },
    {
    "source": {
    "id": "business-insider",
    "name": "Business Insider"
    },
    "author": "Chris Kaye",
    "title": "Companies are using Twitter's own tools to keep their ads away from Elon Musk's tweets",
    "description": "Twitter has \"adjacency controls\" promoted by Elon Musk that help companies keep ads clear of certain content or users.",
    "url": "https://www.businessinsider.com/twitter-adjacency-controls-keep-ads-away-from-musk-advertising-revenue-2023-6",
    "urlToImage": "https://i.insider.com/63f3500f5ca81e00185577a4?width=1200&format=jpeg",
    "publishedAt": "2023-06-06T01:46:06Z",
    "content": "Twitter CEO Elon Musk appearing at a 2022 Tesla event.Suzanne Cordeiro/AFP via Getty Images\r\n<ul>\n<li>Elon Musk told the BBC in April that \"almost all advertisers have come back to Twitter.\"</li>\n<li… [+2442 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Analysis-Can Biden's compromise strategy fix a divided US?",
    "description": "Analysis-Can Biden's compromise strategy fix a divided US?",
    "url": "https://www.investing.com/news/economy/analysiscan-bidens-handshake-to-a-gunfight-strategy-fix-what-ails-the-us-3098487",
    "urlToImage": "https://i-invdn-com.investing.com/news/LYNXMPEE6H1AX_L.jpg",
    "publishedAt": "2023-06-06T01:35:51Z",
    "content": "By Trevor Hunnicutt\r\nWASHINGTON (Reuters) -The deal to end the United States' debt limit standoff was classic Joe Biden politics: eke out a narrow compromise from an ugly beginning and declare victor… [+4333 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Can Biden's compromise strategy fix a divided US?",
    "description": "(marketscreener.com) The deal to end the\nUnited States' debt limit standoff was classic Joe Biden\npolitics: eke out a narrow compromise from an ugly beginning and\ndeclare victory.\n Biden's pact with Republican Kevin McCarthy suspends the\n$31.4 trillion U.S. d…",
    "url": "https://www.marketscreener.com/quote/stock/TESLA-INC-6344549/news/Can-Biden-s-compromise-strategy-fix-a-divided-US-44042356/?utm_medium=RSS&utm_content=20230606",
    "urlToImage": "https://img.zonebourse.com/reuters/2023-05/2023-05-22T221814Z_1_LYNXMPEJ4L0SD_RTROPTP_3_USA-DEBT.JPG",
    "publishedAt": "2023-06-06T01:32:19Z",
    "content": "WASHINGTON, June 5 (Reuters) - The deal to end the\r\nUnited States' debt limit standoff was classic Joe Biden\r\npolitics: eke out a narrow compromise from an ugly beginning and\r\ndeclare victory.\r\nBiden… [+4478 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "Linda Lew",
    "title": "Chinese Unicorn Claims Breakthrough With All-Weather EV Battery",
    "description": "(Bloomberg) -- A Chinese battery startup claims to have overcome one of the key sticking points for electric car owners — the loss of power capability and...",
    "url": "https://finance.yahoo.com/news/chinese-unicorn-claims-breakthrough-weather-013000174.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/X3ImGzp6YShSgCTWEM21Kw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_technology_68/b44fadd551de8dff7ef61f75f96a2720",
    "publishedAt": "2023-06-06T01:30:00Z",
    "content": "(Bloomberg) -- A Chinese battery startup claims to have overcome one of the key sticking points for electric car owners the loss of power capability and range in cold climates.\r\nMost Read from Bloomb… [+2574 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "SiliconANGLE News"
    },
    "author": "James Farrell",
    "title": "New Twitter boss Linda Yaccarino starts her job today in difficult times",
    "description": "Linda Yaccarino will begin her job as Twitter Inc. chief executive today, reportedly much earlier than expected. Prior to taking the post, Yaccarino had worked for four years as head of NBCUniversal Media LLC’s advertising and partnership team. Back in Decemb…",
    "url": "https://siliconangle.com/2023/06/05/new-twitter-boss-linda-yaccarino-starts-job-today-difficult-times/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2023/06/alexander-shatov-k1xf2D7jWUs-unsplash.jpg",
    "publishedAt": "2023-06-06T01:25:58Z",
    "content": "Linda Yaccarino will begin her job as Twitter Inc. chief executive today, reportedly much earlier than expected.\r\nPrior to taking the post, Yaccarino had worked for four years as head of NBCUniversal… [+2909 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "SiliconANGLE News"
    },
    "author": "James Farrell",
    "title": "New Twitter boss Linda Yaccarino starts her job today at a difficult time",
    "description": "Linda Yaccarino began her job as Twitter Inc. chief executive today, reportedly much earlier than expected. Prior to taking the post, Yaccarino had worked for four years as head of NBCUniversal Media LLC’s advertising and partnership team. Back in December, M…",
    "url": "https://siliconangle.com/2023/06/05/new-twitter-boss-linda-yaccarino-starts-job-today-difficult-time/",
    "urlToImage": "https://d15shllkswkct0.cloudfront.net/wp-content/blogs.dir/1/files/2023/06/alexander-shatov-k1xf2D7jWUs-unsplash.jpg",
    "publishedAt": "2023-06-06T01:25:58Z",
    "content": "Linda Yaccarino began her job as Twitter Inc. chief executive today, reportedly much earlier than expected.\r\nPrior to taking the post, Yaccarino had worked for four years as head of NBCUniversal Medi… [+2854 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "asia.nikkei.com",
    "title": "Panasonic to boost EV battery output at Tesla's Gigafactory Nevada",
    "description": "TOKYO -- Japanese electronics giant Panasonic will expand production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla, its biggest customer. The company has accelerated plans to increase battery production capacity, responding …",
    "url": "https://biztoc.com/x/441234d9bccab2cd",
    "urlToImage": "https://c.biztoc.com/p/441234d9bccab2cd/s.webp",
    "publishedAt": "2023-06-06T01:24:09Z",
    "content": "TOKYO -- Japanese electronics giant Panasonic will expand production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla, its biggest customer.The company has accelerated… [+245 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Moneycontrol"
    },
    "author": "Reuters",
    "title": "Elon Musk says China will initiate AI regulations",
    "description": "Elon Musk did not elaborate further and made his remarks in a Twitter Space with Democratic presidential candidate Robert F. Kennedy Jr. on Monday.",
    "url": "https://www.moneycontrol.com/news/world/elon-musk-says-china-will-initiate-ai-regulations-10747971.html",
    "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/03/Elon-musk-770x433-770x433.png",
    "publishedAt": "2023-06-06T01:22:57Z",
    "content": "The Chinese government will seek to initiate artificial intelligence regulations in its country, billionaire Elon Musk said on Monday after meeting with officials during his recent trip to China.\r\nMu… [+1926 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Moneycontrol"
    },
    "author": "Reuters",
    "title": "Panasonic to boost battery output at Tesla#39;s Nevada Gigafactory",
    "description": "The company#39;s unit, Panasonic Energy, will install a 15th production line at Gigafactory Nevada, the report said.",
    "url": "https://www.moneycontrol.com/news/world/panasonic-to-boost-battery-output-at-teslas-nevada-gigafactory-10747941.html",
    "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/panasonic-770x433.jpg",
    "publishedAt": "2023-06-06T01:17:01Z",
    "content": "Japan's Panasonic Holdings Corp will expand the production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla Inc, the Nikkei reported on Monday, citing people familiar … [+1282 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "thestreet.com",
    "title": "Tesla Foe Stellantis Expands Its Electric Vehicle Goal",
    "description": "The race for Tesla rivals to become all-electric is getting more competitive as legacy automakers unveil and produce new electric vehicles and retire their internal combustion engine models. The list of automakers introducing new EVs is growing each day. Firs…",
    "url": "https://biztoc.com/x/557b7e59c43fe0fd",
    "urlToImage": "https://c.biztoc.com/p/557b7e59c43fe0fd/s.webp",
    "publishedAt": "2023-06-06T01:10:13Z",
    "content": "The race for Tesla rivals to become all-electric is getting more competitive as legacy automakers unveil and produce new electric vehicles and retire their internal combustion engine models.The list … [+299 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Thegatewaypundit.com"
    },
    "author": "Mike LaChance",
    "title": "Two House Republicans Introduce Legislation to Save AM Radio in Newly Manufactured Cars",
    "description": "Some automobile manufacturers have considered cutting AM radio from production of new cars.\nThe post Two House Republicans Introduce Legislation to Save AM Radio in Newly Manufactured Cars appeared first on The Gateway Pundit.",
    "url": "https://www.thegatewaypundit.com/2023/06/two-house-republicans-introduce-legislation-save-am-radio/",
    "urlToImage": "https://www.thegatewaypundit.com/wp-content/uploads/Car-Radio-1200x630.jpg",
    "publishedAt": "2023-06-06T01:05:13Z",
    "content": "Some automobile manufacturers have considered cutting AM radio from production of new cars. This is a terrible idea for two reasons.\r\nFirst, AM radio is where you find many of the most popular talk r… [+2290 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Moneycontrol"
    },
    "author": "PTI",
    "title": "Binance, world#39;s top crypto exchange, at center of US investigations",
    "description": "The U.S. Commodity Futures Trading Commission (CFTC) also sued Binance over regulatory violations in March. Binance did not immediately respond to a request for comment for this story.",
    "url": "https://www.moneycontrol.com/news/world/binance-worlds-top-crypto-exchange-at-center-of-us-investigations-10747901.html",
    "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/03/Binance-770x433.png",
    "publishedAt": "2023-06-06T01:03:28Z",
    "content": "The world's biggest cryptocurrency exchange Binance and its CEO Changpeng Zhao have been sued by the U.S. Securities and Exchange Commission (SEC), which alleged in a June 5 court filing that the fir… [+5040 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Pajiba.com"
    },
    "author": "Mike Redmond",
    "title": "Taylor Swift and Matt Healy Broke Up Already",
    "description": "Normally, this is the part where I say something like, \"Sorry for writing about Taylor Swift two nights in a row,\" but here's the thing: I'm not! This is a golden gift from the click gods, and I'm going to...",
    "url": "https://www.pajiba.com/pajiba_love/taylor-swift-and-matt-healy-broke-up-already.php",
    "urlToImage": "https://www.pajiba.com/assets_c/2023/06/taylor-swift-matt-healy-break-up-thumb-700x467-254330.jpg",
    "publishedAt": "2023-06-06T01:00:00Z",
    "content": "By Mike Redmond | Pajiba Love | June 5, 2023 | \r\nBy Mike Redmond | Pajiba Love | June 5, 2023 |\r\nNormally, this is the part where I say something like, “Sorry for writing about Taylor Swift two night… [+2049 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "foxbusiness.com",
    "title": "Elon Musk says Target can expect shareholder lawsuits soon as retailer's woes mount",
    "description": "Billionaire entrepreneur Elon Musk says it is just a matter of time before Target Corp. is hit with legal action from investors as the retailer continues to shed value amid controversy over its Pride merchandising decisions. In response to the news that JPMor…",
    "url": "https://biztoc.com/x/43b4b764aff01184",
    "urlToImage": "https://c.biztoc.com/p/43b4b764aff01184/og.webp",
    "publishedAt": "2023-06-06T00:46:05Z",
    "content": "Billionaire entrepreneur Elon Musk says it is just a matter of time before Target Corp. is hit with legal action from investors as the retailer continues to shed value amid controversy over its Pride… [+306 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CNBC"
    },
    "author": "Julie Coleman",
    "title": "Cramer says it's still a bull market, but trim a few tech stocks and profit while you can",
    "description": "Even though he believes it's still a bull market, CNBC's Jim Cramer told investors on Monday to trim their tech stock and make a profit while they still can.",
    "url": "https://www.cnbc.com/2023/06/05/jim-cramer-says-trim-a-few-tech-stocks-and-profit-while-you-can.html",
    "urlToImage": "https://image.cnbcfm.com/api/v1/image/107059904-1652322792218-200222_IMG_0732.jpg?v=1686011832&w=1920&h=1080",
    "publishedAt": "2023-06-06T00:40:42Z",
    "content": "CNBC's Jim Cramer told investors on Monday to trim their tech stock and enjoy some of the fruits of their labor while they still can.\r\n\"Unless you're terminally greedy or totally braindead, you take … [+1915 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "World Resources Institute",
    "title": "What Is the “Global Stocktake” & How Can It Accelerate Climate Action?",
    "description": "This year is a critical moment for climate action. The mounting impacts of climate change, from floods and droughts to hurricanes and heat waves, are taking a major toll on human lives and economies globally — particularly in vulnerable developing nations wit…",
    "url": "https://cleantechnica.com/2023/06/05/what-is-the-global-stocktake-how-can-it-accelerate-climate-action/",
    "urlToImage": "http://cleantechnica.com/files/2023/04/IMG_9069-e1682078965756-800x600.jpg",
    "publishedAt": "2023-06-06T00:38:06Z",
    "content": "This year is a critical moment for climate action.\r\nThe mounting impacts of climate change, from floods and droughts to hurricanes and heat waves, are taking a major toll on human lives and economies… [+21056 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "finance.yahoo.com",
    "title": "The stock market could rally 20% through the rest of this year if it can clear 3 key hurdles, Fundstrat says",
    "description": "None Stocks are in for a 20% rally through the rest of 2023 if they can clear three hurdles, Fundstrat's Tom Lee said. • None Lee pointed to signs of falling inflation and improving market breadth that support his bull case. • None He has made the case for mo…",
    "url": "https://biztoc.com/x/cc2b755c41fbf8e7",
    "urlToImage": "https://c.biztoc.com/p/cc2b755c41fbf8e7/s.webp",
    "publishedAt": "2023-06-06T00:28:04Z",
    "content": "None Stocks are in for a 20% rally through the rest of 2023 if they can clear three hurdles, Fundstrat's Tom Lee said.None Lee pointed to signs of falling inflation and improving market breadth that … [+264 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Japan Today"
    },
    "author": null,
    "title": "Musk says China detailed plans to regulate AI",
    "description": "Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech billionaire said Monday, in his first comments on the two-day visit. The Twitter owner and Tesla CEO -- one o…",
    "url": "https://japantoday.com/category/tech/musk-says-china-detailed-plans-to-regulate-ai",
    "urlToImage": null,
    "publishedAt": "2023-06-06T00:13:59Z",
    "content": "Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech billionaire said Monday, in his first comments on… [+2429 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Factbox-Binance, world's top crypto exchange, at center of US investigations",
    "description": "Factbox-Binance, world's top crypto exchange, at center of US investigations",
    "url": "https://www.investing.com/news/economy/factboxbinance-worlds-top-crypto-exchange-at-center-of-us-investigations-3098685",
    "urlToImage": "https://i-invdn-com.investing.com/news/STOCK-EXCHANGE-RUSSIAN-TRADING-SYSTEMS_800x533_L_1414427815.jpg",
    "publishedAt": "2023-06-06T00:10:44Z",
    "content": "By Tom Wilson and Hannah Lang\r\nLONDON/WASHINGTON(Reuters) -The world's biggest cryptocurrency exchange Binance and its CEO Changpeng Zhao have been sued by the U.S. Securities and Exchange Commission… [+5132 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "fortune.com",
    "title": "Man suing Tesla for being a 'hotbed for racist behavior' wants to add 240 black colleagues to his incendiary complaint",
    "description": "A Black former assembly line staffer at Tesla is moving to add almost 240 other workers to his 2017 lawsuit in which he called the electric-car maker’s production floor a “hotbed for racist behavior.” Marcus Vaughn says class-action status is appropriate to a…",
    "url": "https://biztoc.com/x/2964810c1050e241",
    "urlToImage": "https://c.biztoc.com/p/2964810c1050e241/s.webp",
    "publishedAt": "2023-06-06T00:10:04Z",
    "content": "A Black former assembly line staffer at Tesla is moving to add almost 240 other workers to his 2017 lawsuit in which he called the electric-car makers production floor a hotbed for racist behavior.Ma… [+288 chars]"
    },
    {
    "source": {
    "id": "fortune",
    "name": "Fortune"
    },
    "author": "Malathi Nayak, Bloomberg",
    "title": "Man suing Tesla for being a 'hotbed for racist behavior' wants to add 240 black colleagues to his incendiary complaint",
    "description": "In sworn statements, other Black former employees claim they too were offended by racist graffiti in common areas and slurs in the workplace.",
    "url": "https://fortune.com/2023/06/05/tesla-racism-lawsuit-black-workers/",
    "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/06/GettyImages-1434797513-e1686008969818.jpg?resize=1200,600",
    "publishedAt": "2023-06-06T00:04:57Z",
    "content": "A Black former assembly line staffer at Tesla is moving to add almost 240 other workers to his 2017 lawsuit in which he called the electric-car makers production floor a hotbed for racist behavior. M… [+2318 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Motley Fool"
    },
    "author": "newsfeedback@fool.com (The Daily Upside)",
    "title": "Twitter's Ad Revenue is Down, Just Not According to Elon",
    "description": "Elon Musk says nearly all of those hundreds of advertisers who stopped spending money on Twitter in recent months have returned. Well if they have,...",
    "url": "https://www.fool.com/investing/2023/06/05/twitters-ad-revenue-is-down-just-not-according-to/",
    "urlToImage": "https://g.foolcdn.com/editorial/images/735227/featured-daily-upside-image.jpg",
    "publishedAt": "2023-06-06T00:00:09Z",
    "content": "For more crisp and insightful business and economic news, subscribe to\r\nThe Daily Upside newsletter.\r\nIt's completely free and we guarantee you'll learn something new every day.\r\nElon Musk says nearl… [+2986 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "thedailyupside.com",
    "title": "Twitter’s Ad Revenue is Down, Just Not According to Elon",
    "description": "Elon Musk says nearly all of those hundreds of advertisers who stopped spending money on Twitter in recent months have returned. Well if they have, they’re not spending any money. A report by The New York Times found that Twitter’s ad revenue from April to Ma…",
    "url": "https://biztoc.com/x/0d60e166b9190a1d",
    "urlToImage": "https://c.biztoc.com/p/0d60e166b9190a1d/s.webp",
    "publishedAt": "2023-06-06T00:00:06Z",
    "content": "Elon Musk says nearly all of those hundreds of advertisers who stopped spending money on Twitter in recent months have returned. Well if they have, theyre not spending any money.A report by The New Y… [+295 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "cnbc.com",
    "title": "The market may be primed for the Dow to lead with the debt ceiling resolved, Jim Cramer says",
    "description": "CNBC's Jim Cramer explained that last week's debt ceiling resolution may have paved the way for a Dow resurgence, even though the index closed lower by about 200 points Monday. \"With the default fears off the table, maybe this is a market where the once might…",
    "url": "https://biztoc.com/x/ef3e3ed64aae4dd4",
    "urlToImage": "https://c.biztoc.com/p/ef3e3ed64aae4dd4/s.webp",
    "publishedAt": "2023-06-05T23:56:05Z",
    "content": "CNBC's Jim Cramer explained that last week's debt ceiling resolution may have paved the way for a Dow resurgence, even though the index closed lower by about 200 points Monday.\"With the default fears… [+266 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "SlashGear"
    },
    "author": "staff@slashgear.com (Nadeem Sarwar)",
    "title": "Elon Musk Says Tesla Is Open To Licensing Out Autopilot And Other EV Tech",
    "description": "Following its Ford and Superchargers news, Elon Musk has said that Tesla is willing to license out its EV tech to other automakers. Will any of them bite?",
    "url": "https://www.slashgear.com/1305695/elon-musk-says-tesla-open-licensing-autopilot-ev-tech/",
    "urlToImage": "https://www.slashgear.com/img/gallery/elon-musk-says-tesla-is-open-to-licensing-out-autopilot-and-other-ev-tech/l-intro-1686007864.jpg",
    "publishedAt": "2023-06-05T23:43:43Z",
    "content": "\"In the same way that maybe Android is helpful to the phone industry as sort of a general standard, like, we could potentially open source more code,\" Elon Musk said during a Twitter Space session wi… [+973 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CNBC"
    },
    "author": "Julie Coleman",
    "title": "The market may be primed for the Dow to lead with the debt ceiling resolved, Jim Cramer says",
    "description": "CNBC's Jim Cramer explained that last week's debt ceiling resolution may have paved the way for a Dow resurgence.",
    "url": "https://www.cnbc.com/2023/06/05/cramer-after-the-debt-ceiling-deal-dow-may-be-ready-to-lead-market.html",
    "urlToImage": "https://image.cnbcfm.com/api/v1/image/107109967-1661524568032-NUP_198430_00186r.jpg?v=1686008523&w=1920&h=1080",
    "publishedAt": "2023-06-05T23:42:36Z",
    "content": "CNBC's Jim Cramer explained that last week's debt ceiling resolution may have paved the way for a Dow resurgence, even though the index closed lower by about 200 points Monday.\r\n\"With the default fea… [+2919 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "decrypt.co",
    "title": "Robert F. Kennedy Jr. Silent on Bitcoin and CBDC During Twitter Talk with Elon Musk",
    "description": "Tesla CEO and Twitter owner Elon Musk hosted a conversation with presidential candidate Robert F. Kennedy Jr on Monday. And while it lasted for more than two hours, Bitcoin and the digital assets industry never came up. The chit-chat between the two, moderate…",
    "url": "https://biztoc.com/x/e787a881afc638c3",
    "urlToImage": "https://c.biztoc.com/p/e787a881afc638c3/s.webp",
    "publishedAt": "2023-06-05T23:28:05Z",
    "content": "Tesla CEO and Twitter owner Elon Musk hosted a conversation with presidential candidate Robert F. Kennedy Jr on Monday. And while it lasted for more than two hours, Bitcoin and the digital assets ind… [+294 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Decrypt"
    },
    "author": "André Beganski",
    "title": "Robert F. Kennedy Jr. Silent on Bitcoin and CBDC During Twitter Talk with Elon Musk",
    "description": "He also asked Balaji Srinivasan, Coinbase’s former CTO, to be his Treasury Secretary.",
    "url": "https://decrypt.co/143517/robert-f-kennedy-jr-silent-on-bitcoin-and-cbdc-during-twitter-talk-with-elon-musk",
    "urlToImage": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2023/06/DSCF6639-scaled-gID_7.jpeg",
    "publishedAt": "2023-06-05T23:23:36Z",
    "content": "Tesla CEO and Twitter owner Elon Musk hosted a conversation with presidential candidate Robert F. Kennedy Jr on Monday. And while it lasted for more than two hours, Bitcoin and the digital assets ind… [+3635 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "thestreet.com",
    "title": "Tesla’s Stock Just Did Something Important",
    "description": "Tesla’s stock isn’t for the faint of heart. On any given day, shares can pop or drop based on something its mercurial CEO, Elon Musk, says or does. Most were willing to accept that trade-off when Tesla’s shares roared higher. However, disappointing returns la…",
    "url": "https://biztoc.com/x/674d2cf71d94d7b0",
    "urlToImage": "https://c.biztoc.com/p/674d2cf71d94d7b0/s.webp",
    "publishedAt": "2023-06-05T23:18:10Z",
    "content": "Teslas stock isnt for the faint of heart. On any given day, shares can pop or drop based on something its mercurial CEO, Elon Musk, says or does.Most were willing to accept that trade-off when Teslas… [+253 chars]"
    },
    {
    "source": {
    "id": "independent",
    "name": "Independent"
    },
    "author": "Eric Garcia",
    "title": "Voices: Musk’s strategy is becoming clearer: Flood the zone with BS",
    "description": "Musk knows we can’t look away from his side show. So he’s using it to throw as much misinformation as possible out there",
    "url": "https://www.independent.co.uk/voices/elon-musk-rfk-twitter-bannon-b2351931.html",
    "urlToImage": "https://static.independent.co.uk/2023/06/05/21/GettyImages-1255040637.jpg?quality=75&width=1200&auto=webp",
    "publishedAt": "2023-06-05T22:39:01Z",
    "content": "Sign up for the View from Westminster email for expert analysis straight to your inbox\r\nGet our free View from Westminster email\r\nIn 2018, Steve Bannon, the on-again-off-again strategist and consigli… [+4155 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "foxbusiness.com",
    "title": "Elon Musk says Target can expect shareholder lawsuits soon as retailer's woes mount",
    "description": "Billionaire entrepreneur Elon Musk says it is just a matter of time before Target Corp. is hit with legal action from investors as the retailer continues to shed value amid controversy over its Pride merchandising decisions. In response to the news that JPMor…",
    "url": "https://biztoc.com/x/05d54acc1bab8965",
    "urlToImage": "https://c.biztoc.com/p/05d54acc1bab8965/s.webp",
    "publishedAt": "2023-06-05T22:38:05Z",
    "content": "Billionaire entrepreneur Elon Musk says it is just a matter of time before Target Corp. is hit with legal action from investors as the retailer continues to shed value amid controversy over its Pride… [+300 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "forbes.com",
    "title": "Apple Stock Hits All-Time High",
    "description": "Apple shares hit their highest price in the stock’s 43-year history early Monday ahead of the debut of its mixed reality Vision Pro headset, though the stock then slid after the tech giant announced a far heftier than expected price tag for its biggest produc…",
    "url": "https://biztoc.com/x/f3d8b3531babbd71",
    "urlToImage": "https://c.biztoc.com/p/f3d8b3531babbd71/og.webp",
    "publishedAt": "2023-06-05T22:36:17Z",
    "content": "Apple shares hit their highest price in the stocks 43-year history early Monday ahead of the debut of its mixed reality Vision Pro headset, though the stock then slid after the tech giant announced a… [+291 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "investors.com",
    "title": "Tesla Stock, Uber Take Pole Position While 3 Stocks Get Spicy",
    "description": "and Uber Technologies (UBER) rev up their positions on IBD Leaderboard as investors also place their bets on DraftKings (DKNG). As Tesla stock climbs, Chipotle Mexican Grill (CMG), Wingstop (WING) and ELF Beauty (ELF) spice up the watchlist. Including Tesla, …",
    "url": "https://biztoc.com/x/baa9a62e13bbb301",
    "urlToImage": "https://c.biztoc.com/p/baa9a62e13bbb301/og.webp",
    "publishedAt": "2023-06-05T22:36:14Z",
    "content": "and Uber Technologies (UBER) rev up their positions on IBD Leaderboard as investors also place their bets on DraftKings (DKNG). As Tesla stock climbs, Chipotle Mexican Grill (CMG), Wingstop (WING) an… [+295 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "International Business Times"
    },
    "author": "AFP News",
    "title": "Musk Says China Detailed Plans To Regulate AI",
    "description": "Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech billionaire said Monday, in his first comments on the two-day visit.",
    "url": "https://www.ibtimes.com/musk-says-china-detailed-plans-regulate-ai-3697848",
    "urlToImage": "https://d.ibtimes.com/en/full/4463370/elon-musk-pictured-2022-caused-controversy-suggesting-self-ruled-island-taiwan-should-become.jpg",
    "publishedAt": "2023-06-05T22:30:43Z",
    "content": "Elon Musk, pictured in 2022, caused controversy by suggesting the self-ruled island of Taiwan should become part of ChinaAFP\r\nTop Chinese officials told Elon Musk about plans to launch new regulation… [+2683 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "AFP",
    "title": "Musk says China detailed plans to regulate AI",
    "description": "Top Chinese officials told Elon Musk about plans to launch new regulations on artificial intelligence on his recent trip to the Asian giant, the tech...",
    "url": "https://news.yahoo.com/musk-says-china-detailed-plans-222745264.html",
    "urlToImage": "https://media.zenfs.com/en/afp.com/83246e3e5f5f66a6cbbdde8de0ca0924",
    "publishedAt": "2023-06-05T22:27:45Z",
    "content": "Elon Musk, pictured in 2022, caused controversy by suggesting the self-ruled island of Taiwan should become part of China\r\nTop Chinese officials told Elon Musk about plans to launch new regulations o… [+2549 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "description": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "url": "https://www.investing.com/news/stock-market-news/panasonic-to-boost-battery-output-at-teslas-nevada-gigafactory--nikkei-3098663",
    "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEB8T05E_L.jpg",
    "publishedAt": "2023-06-05T22:20:45Z",
    "content": "(Reuters) -Japan's Panasonic (OTC:PCRFY) Holdings Corp will expand the production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla (NASDAQ:TSLA) Inc, the Nikkei report… [+1320 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "ValueWalk"
    },
    "author": "deVere Group",
    "title": "Beware Of The ‘Magnificent Seven’ Stocks Hype, Investors Warned",
    "description": "The 'Magnificent Seven' stocks that account for around 90% of gains on Walls Street’s S&P 500 this year are impressive, but not a silver bullet for investors",
    "url": "https://www.valuewalk.com/beware-of-the-magnificent-seven-stocks-hype-investors-warned/",
    "urlToImage": "https://www.valuewalk.com/wp-content/uploads/2019/02/Stock-Exchange.jpeg",
    "publishedAt": "2023-06-05T22:13:40Z",
    "content": "The Magnificent Seven stocks that account for around 90% of gains on Walls Streets S&amp;P 500 this year are impressive, but not a silver bullet for investors, warns the CEO and founder of one of the… [+3198 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Electrek"
    },
    "author": "Peter Johnson",
    "title": "EVs are winning over largely conservative areas as buyers look to save money",
    "description": "At least Democrats and Republicans are beginning to agree on one thing – EVs can save you money (and the environment). Although EVs are often associated with liberal-leaning voters, more and more conservative buyers are going electric to save money on gas and…",
    "url": "https://electrek.co/2023/06/05/evs-winning-over-largely-conservative-areas/",
    "urlToImage": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2023/06/EVs-conservatives.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "publishedAt": "2023-06-05T22:05:36Z",
    "content": "At least Democrats and Republicans are beginning to agree on one thing EVs can save you money (and the environment). Although EVs are often associated with liberal-leaning voters, more and more conse… [+3598 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Telegraph.co.uk"
    },
    "author": "Rozina Sabur",
    "title": "Robert F Kennedy Jr thanks Elon Musk for saving American democracy in bizarre Twitter chat",
    "description": "The longshot candidate for US president at one point implied Covid was not a real disease in a rambling discussion with the Tesla boss",
    "url": "https://www.telegraph.co.uk/world-news/2023/06/05/robert-f-kennedy-jr-elon-musk-twitter-us-election-2024/",
    "urlToImage": "https://www.telegraph.co.uk/content/dam/world-news/2023/06/05/TELEMMGLPICT000338356806_16860025281660_trans_NvBQzQNjv4Bq_4lZL6XGyKd1IzVfh-3zql5NUcTKNHKqy85KLqtvPLE.jpeg?impolicy=logo-overlay",
    "publishedAt": "2023-06-05T22:04:17Z",
    "content": "Robert F Kennedy Jr, a prominent conspiracy theorist and longshot presidential candidate, praised Elon Musk for rescuing American democracy in a bizarre Twitter discussion between the pair on Monday.… [+1517 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "Reuters",
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "description": "The company's unit, Panasonic Energy, will install a 15th production line at Gigafactory Nevada, the report said.  The report comes after Panasonic said last...",
    "url": "https://finance.yahoo.com/news/panasonic-boost-battery-output-teslas-220000746.html",
    "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/c208a595b85b5a4f76d8eecb195d868b",
    "publishedAt": "2023-06-05T22:00:00Z",
    "content": "(Reuters) -Japan's Panasonic Holdings Corp will expand the production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla Inc, the Nikkei reported on Monday, citing peopl… [+1367 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CNA"
    },
    "author": null,
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "description": ":Japan's Panasonic Holdings Corp will expand the production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla Inc, the Nikkei reported on Monday, citing people familiar with the matter.The company's unit, Panasonic Energy, will …",
    "url": "https://www.channelnewsasia.com/business/panasonic-boost-battery-output-teslas-nevada-gigafactory-nikkei-3541166",
    "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--oCCrc-sP--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2023-06-05t220000z_1_lynxmpej540w1_rtroptp_3_panasonic-ceo.jpg?itok=ighdG8Qy",
    "publishedAt": "2023-06-05T22:00:00Z",
    "content": ":Japan's Panasonic Holdings Corp will expand the production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla Inc, the Nikkei reported on Monday, citing people familiar… [+1292 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "description": "(marketscreener.com) Japan's Panasonic Holdings Corp\nwill expand the production of electric vehicle\nbatteries at a factory in Nevada jointly operated with Tesla Inc\n, the Nikkei reported on Monday, citing people familiar\nwith the matter.\n The company's unit, …",
    "url": "https://www.marketscreener.com/quote/stock/PANASONIC-HOLDINGS-CORPOR-6492473/news/Panasonic-to-boost-battery-output-at-Tesla-s-Nevada-Gigafactory-Nikkei-44043526/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://img.zonebourse.com/reuters/2023-06/2023-06-05T220000Z_1_LYNXMPEJ540W1_RTROPTP_3_PANASONIC-CEO.JPG",
    "publishedAt": "2023-06-05T21:56:30Z",
    "content": "June 5 (Reuters) - Japan's Panasonic Holdings Corp\r\nwill expand the production of electric vehicle\r\nbatteries at a factory in Nevada jointly operated with Tesla Inc\r\n, the Nikkei reported on Monday, … [+1386 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "MarketWatch"
    },
    "author": "MarketWatch Automation",
    "title": "Company Close Updates: Workhorse Group Inc. stock falls Monday, underperforms market",
    "description": "Shares of Workhorse Group Inc. slipped 3.90% to $0.84 Monday, on what proved to be an all-around grim trading session for the stock market, with the NASDAQ...",
    "url": "https://www.marketwatch.com/data-news/workhorse-group-inc-stock-falls-monday-underperforms-market-6766a419-4a2c14b97e16",
    "urlToImage": "https://images.mktw.net/im-220105/social",
    "publishedAt": "2023-06-05T21:55:37Z",
    "content": "Shares of Workhorse Group Inc. \r\n WKHS,\r\n -3.90%\r\nslipped 3.90% to $0.84 Monday, on what proved to be an all-around grim trading session for the stock market, with the NASDAQ Composite Index \r\n COMP,… [+733 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Barron's"
    },
    "author": "Andrew Bary",
    "title": "Blackstone Stock Drops as Palo Alto Networks Is Added to S&P 500",
    "description": "Blackstone should make it into the S&P 500 later this year. Uber, Airbnb, Snowflake, and KKR also could be added to the index in 2023.",
    "url": "https://www.barrons.com/articles/blackstone-stock-price-s-p-500-db8cb09d",
    "urlToImage": "https://images.barrons.com/im-794596/social",
    "publishedAt": "2023-06-05T21:55:37Z",
    "content": "Blackstone\r\n stock fell Monday on evident disappointment that it will have to wait to join the \r\n S&amp;P 500.While there has been speculation that \r\n Blackstone\r\n (ticker: BX) would soon be included… [+2539 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Panasonic to boost battery output at Tesla's Nevada Gigafactory - Nikkei",
    "description": "(marketscreener.com) Japanese electronics giant Panasonic\nHoldings Corp will expand the production of electric\nvehicle batteries at a factory in Nevada jointly operated with\nTesla Inc, Nikkei reported on Monday, citing people\nfamiliar with the matter.\n \n http…",
    "url": "https://www.marketscreener.com/quote/stock/PANASONIC-HOLDINGS-CORPOR-6492473/news/Panasonic-to-boost-battery-output-at-Tesla-s-Nevada-Gigafactory-Nikkei-44043496/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "publishedAt": "2023-06-05T21:45:49Z",
    "content": "June 5 (Reuters) - Japanese electronics giant Panasonic\r\nHoldings Corp will expand the production of electric\r\nvehicle batteries at a factory in Nevada jointly operated with\r\nTesla Inc, Nikkei report… [+128 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "beincrypto.com",
    "title": "Elon Musk Hit With Insider Trading Lawsuit Over Dogecoin",
    "description": "Elon Musk, the fabulously wealthy innovator, faces a class-action lawsuit from investors who accuse him of insider trading and manipulating Dogecoin (DOGE). Musk’s actions allegedly led to a significant rise in Dogecoin’s price. Its subsequent crash left the …",
    "url": "https://biztoc.com/x/fa4a2818c77194aa",
    "urlToImage": "https://c.biztoc.com/p/fa4a2818c77194aa/s.webp",
    "publishedAt": "2023-06-05T21:44:05Z",
    "content": "Elon Musk, the fabulously wealthy innovator, faces a class-action lawsuit from investors who accuse him of insider trading and manipulating Dogecoin (DOGE). Musks actions allegedly led to a significa… [+284 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "asia.nikkei.com",
    "title": "Panasonic to boost battery output at Tesla's Gigafactory Nevada",
    "description": "TOKYO -- Japanese electronics giant Panasonic will expand production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla, its biggest customer. The company has accelerated plans to increase battery production capacity, responding …",
    "url": "https://biztoc.com/x/0dd376a83d34fa6c",
    "urlToImage": "https://c.biztoc.com/p/0dd376a83d34fa6c/s.webp",
    "publishedAt": "2023-06-05T21:40:07Z",
    "content": "TOKYO -- Japanese electronics giant Panasonic will expand production of electric vehicle batteries at a factory in Nevada jointly operated with Tesla, its biggest customer.The company has accelerated… [+245 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Steve Hanley",
    "title": "MAN Goes All In On Electric Buses, Daimler Introduces Fuel Cell eCitaro",
    "description": "MAN and Daimler announced new electric buses in a trade show in Barcelona this week, a signal that the days of diesel engines are numbered.",
    "url": "https://cleantechnica.com/2023/06/05/man-goes-all-in-on-electric-buses-daimler-introduces-fuel-cell-ecitaro/",
    "urlToImage": "https://cleantechnica.com/files/2023/06/MAN-Lions-City-10-E-bus.jpg",
    "publishedAt": "2023-06-05T21:35:15Z",
    "content": "The diesel engine is dead. It just doesn’t know it yet. In Europe, people actually ride buses and enjoy them. Americans would rather stick a fork in their eye than ride a bus. It’s a cultural thing; … [+7061 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Tech Slips as AI Optimism Fades -- Tech Roundup",
    "description": "(marketscreener.com) \n Shares of technology companies slipped as optimism about a new wave of artificial-intelligence technology faltered somewhat. \n\n Palantir Technologies rose after the AI-associated consulting firm received a $463 million contract from the…",
    "url": "https://www.marketscreener.com/quote/stock/APPLE-INC-4849/news/Tech-Slips-as-AI-Optimism-Fades-Tech-Roundup-44043332/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdgris.png",
    "publishedAt": "2023-06-05T21:22:02Z",
    "content": "Shares of technology companies slipped as optimism about a new wave of artificial-intelligence technology faltered somewhat. \r\nPalantir Technologies rose after the AI-associated consulting firm recei… [+809 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "Caleb Naysmith",
    "title": "High-Paying ChatGPT Careers: 30% Of Companies Seek Nontech Professionals For $300,000+ Salaries",
    "description": "In the realm of artificial intelligence (AI), professionals often compare the progress of AI systems to raising a toddler. Similar to how toddlers rely on...",
    "url": "https://finance.yahoo.com/news/high-paying-chatgpt-careers-30-210824179.html",
    "urlToImage": "https://media.zenfs.com/en/Benzinga/2169c8d9a3365a55a634d74c816fd948",
    "publishedAt": "2023-06-05T21:08:24Z",
    "content": "In the realm of artificial intelligence (AI), professionals often compare the progress of AI systems to raising a toddler. Similar to how toddlers rely on adults for guidance and education to develop… [+5245 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "nytimes.com",
    "title": "Is the Bear Market Over? It Depends",
    "description": "Index loses a third of its value in one month early in the pandemic. Index loses a third of its value in one month early in the pandemic. The S&P 500 ended the day nearly 20 percent above its low last year, within a hair of a milestone for some market watcher…",
    "url": "https://biztoc.com/x/78a3d12390f3988d",
    "urlToImage": "https://c.biztoc.com/p/78a3d12390f3988d/s.webp",
    "publishedAt": "2023-06-05T21:04:10Z",
    "content": "Index loses a third of its value in one month early in the pandemic.Index loses a third of its value in one month early in the pandemic.\r\nThe S&amp;P 500 ended the day nearly 20 percent above its low… [+293 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "nytimes.com",
    "title": "Is the Bear Market Over? It Depends",
    "description": "Index loses a third of its value in one month early in the pandemic. Index loses a third of its value in one month early in the pandemic. The S&P 500 ended the day nearly 20 percent above its low last year, within a hair of a milestone for some market watcher…",
    "url": "https://biztoc.com/x/0ab204f43304349f",
    "urlToImage": "https://c.biztoc.com/p/0ab204f43304349f/og.webp",
    "publishedAt": "2023-06-05T21:00:19Z",
    "content": "Index loses a third of its value in one month early in the pandemic.Index loses a third of its value in one month early in the pandemic.\r\nThe S&amp;P 500 ended the day nearly 20 percent above its low… [+293 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "teslarati.com",
    "title": "Tesla stock continues epic run, up over 100% in 2023",
    "description": "Tesla stock (NASDAQ: TSLA) is continuing an epic run as it continues to climb on Monday. Over the past five days, the automaker’s shares have exploded and are up nearly 13 percent at the time of writing. Tesla investors have enjoyed an over 100 percent surge …",
    "url": "https://biztoc.com/x/d2d648493d927bf0",
    "urlToImage": "https://c.biztoc.com/p/d2d648493d927bf0/og.webp",
    "publishedAt": "2023-06-05T21:00:19Z",
    "content": "Tesla stock (NASDAQ: TSLA) is continuing an epic run as it continues to climb on Monday. Over the past five days, the automakers shares have exploded and are up nearly 13 percent at the time of writi… [+288 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Crikey"
    },
    "author": "Emma Elsworthy",
    "title": "Raking over the coals",
    "description": "Environment Minister Tanya Plibersek faces a legal challenge over her coalmine assessment decisions, and Australia is expected to send missile-capable, four-wheel-drive armoured cars to Ukraine.\nThe post Raking over the coals appeared first on Crikey.",
    "url": "https://www.crikey.com.au/2023/06/06/tanya-plibersek-legal-challenge-coalmines/",
    "urlToImage": "https://www.crikey.com.au/wp-content/uploads/2023/05/Plibersek.jpg",
    "publishedAt": "2023-06-05T20:58:12Z",
    "content": "DIGGING FOR DIRT\r\nEnvironment Minister Tanya Plibersek is headed to court over coal project assessments, the Brisbane Times ($) reports. The Environment Council of Central Queensland (ECCQ) is trying… [+12622 chars]"
    },
    {
    "source": {
    "id": "usa-today",
    "name": "USA Today"
    },
    "author": "Amritpal Kaur Sandhu-Longoria, USA TODAY",
    "title": "The Daily Money: May jobs market report gives mixed messages about recession",
    "description": "The May job report shows more jobs, but lower wage growth, less workweek hours and labor hoarding. Is a recession coming or not?",
    "url": "https://www.usatoday.com/story/money/2023/06/05/may-2023-job-report-mixed-signals-looming-recession/70289117007/",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/eLLQlEdIkt7rJb6IvY0lfg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/usa_today_money_325/68446ad7d520eacd215b06e547831eb0",
    "publishedAt": "2023-06-05T20:56:09Z",
    "content": "Good morning, this is Amritpal Kaur Sandhu-Longoria with your Daily Money headlines. If you're happy and you know it, then have a Happy Monday.\r\nIs a recession happening or not? Well, employers added… [+1949 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "forbes.com",
    "title": "Apple Stock Hits All-Time High",
    "description": "Apple shares hit their highest price in the stock’s 43-year history early Monday ahead of the debut of its mixed reality Vision Pro headset, though the stock then slid after the tech giant announced a far heftier than expected price tag for its biggest produc…",
    "url": "https://biztoc.com/x/680b02388b00410e",
    "urlToImage": "https://c.biztoc.com/p/680b02388b00410e/s.webp",
    "publishedAt": "2023-06-05T20:54:04Z",
    "content": "Apple shares hit their highest price in the stocks 43-year history early Monday ahead of the debut of its mixed reality Vision Pro headset, though the stock then slid after the tech giant announced a… [+291 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "MarketWatch"
    },
    "author": "MarketWatch Automation",
    "title": "Company Close Updates: General Motors Co. stock falls Monday, underperforms market",
    "description": "Shares of General Motors Co. slumped 0.44% to $34.13 Monday, on what proved to be an all-around grim trading session for the stock market, with the S&P 500...",
    "url": "https://www.marketwatch.com/data-news/general-motors-co-stock-falls-monday-underperforms-market-c9b45596-5dfd33f02ada",
    "urlToImage": "https://images.mktw.net/im-220105/social",
    "publishedAt": "2023-06-05T20:50:57Z",
    "content": "Shares of General Motors Co. \r\n GM,\r\n -0.44%\r\nslumped 0.44% to $34.13 Monday, on what proved to be an all-around grim trading session for the stock market, with the S&amp;P 500 Index \r\n SPX,\r\n -0.20%… [+667 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Yahoo Entertainment"
    },
    "author": "Yahoo Finance",
    "title": "ChargePoint's stock swung wildly after releasing earnings, the company's CEO gives his take",
    "description": "ChargePoint shares swung wildly following the release of the EV charging company's first quarter results. ChargePoint President and CEO Pasquale Romano joins...",
    "url": "https://finance.yahoo.com/video/chargepoints-stock-swung-wildly-releasing-204712539.html",
    "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aL7iC1dMxh3x3v3jqYX95Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2023-05/e7defe60-03e1-11ee-b77d-96bbdf416ff0",
    "publishedAt": "2023-06-05T20:47:12Z",
    "content": "<ul><li>\r\n</li></ul>\r\nChargePoint shares swung wildly following the release of the EV charging company's first quarter results. ChargePoint President and CEO Pasquale Romano joins Yahoo Finance Live … [+109 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investopedia"
    },
    "author": "Staff Author",
    "title": "Markets Drop as Early Session Gains Fade in the Afternoon",
    "description": "Markets fell on Monday, June 5, 2023 as initial enthusiasm for Apple's new headset faded.",
    "url": "https://www.investopedia.com/markets-drop-as-early-session-gains-fade-7508479",
    "urlToImage": "https://www.investopedia.com/thmb/OTZ23zxGquRCI0U9bawf8vezprQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3qqnH-11-e701bd2604254aa696fc9578018e4ae9.png",
    "publishedAt": "2023-06-05T20:46:19Z",
    "content": "<ul><li>U.S. equities began the day in the green on Monday, June 5, 2023, but faded as the day went on and ended down.</li><li>Apple shares hit an all-time high before retreating after the tech giant… [+2294 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investing.com"
    },
    "author": "Reuters",
    "title": "Elon Musk says China will initiate AI regulations",
    "description": "Elon Musk says China will initiate AI regulations",
    "url": "https://www.investing.com/news/economy/elon-musk-says-he-learned-china-will-initiate-ai-regulations-3098537",
    "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_5_800x533_L_1412601619.jpg",
    "publishedAt": "2023-06-05T20:41:44Z",
    "content": "By Kanishka Singh and Nandita Bose\r\nWASHINGTON (Reuters) - The Chinese government will seek to initiate artificial intelligence regulations in its country, billionaire Elon Musk said on Monday after … [+2001 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "Elon Musk says China will initiate AI regulations",
    "description": "(marketscreener.com) The Chinese government\nwill seek to initiate artificial intelligence regulations in its\ncountry, billionaire Elon Musk said on Monday after meeting with\nofficials during his recent trip to China.\n Musk did not elaborate further and made h…",
    "url": "https://www.marketscreener.com/quote/stock/TESLA-INC-6344549/news/Elon-Musk-says-China-will-initiate-AI-regulations-44042715/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://img.zonebourse.com/reuters/2023-05/2023-05-31T235620Z_1_LYNXMPEJ4U0ZJ_RTROPTP_3_MUSK-CHINA.JPG",
    "publishedAt": "2023-06-05T20:35:52Z",
    "content": "Musk did not elaborate further and made his remarks in a Twitter Space with Democratic presidential candidate Robert F. Kennedy Jr. on Monday.\r\n\"It's worth noting that on my recent trip to China, I w… [+1856 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "CleanTechnica"
    },
    "author": "Guest Contributor",
    "title": "US Issues 20-Year Ban On Drilling Near Indigenous Cultural Site In New Mexico: Protects Chaco Region, Tribal Cultural Sites from Development",
    "description": "The Biden administration announced a 20-year pause on oil or gas exploration on federal lands surrounding the Chaco Culture National",
    "url": "https://cleantechnica.com/2023/06/05/us-issues-20-year-ban-on-drilling-near-indigenous-cultural-site-in-new-mexico-protects-chaco-region-tribal-cultural-sites-from-development/",
    "urlToImage": "https://cleantechnica.com/files/2019/12/2000px-Flag_of_New_Mexico.svg-e1651861620785.png",
    "publishedAt": "2023-06-05T20:35:40Z",
    "content": "Biden-Harris Administration Protects Chaco Region, Tribal Cultural Sites from Development\r\nSecretary of the Interior Deb Haaland took action today to protect the cultural and historic resources surro… [+8172 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "GlobeNewswire"
    },
    "author": "CMI MARKET RESEARCH PRIVATE LIMITED",
    "title": "Global Advanced Driver Assistance Systems (ADAS) Market Size/Share Worth USD 81.17 Billion by 2032 at an 18.2% CAGR: Custom Market Insights (Analysis, Outlook, Leaders, Report, Trends, Forecast, Segmentation, Growth, Growth Rate, Value)",
    "description": "[220+ Pages Latest Report] According to a market research study published by Custom Market Insights, the demand analysis of Global Advanced Driver Assistance Systems (ADAS) Market size & share revenue was valued at approximately USD 18.2 Billion in 2022 and i…",
    "url": "https://www.globenewswire.com/news-release/2023/06/05/2682386/0/en/Global-Advanced-Driver-Assistance-Systems-ADAS-Market-Size-Share-Worth-USD-81-17-Billion-by-2032-at-an-18-2-CAGR-Custom-Market-Insights-Analysis-Outlook-Leaders-Report-Trends-Forec.html",
    "urlToImage": "https://ml.globenewswire.com/Resource/Download/74609d89-5437-4826-b7b8-31238ea2e65c",
    "publishedAt": "2023-06-05T20:30:00Z",
    "content": "Austin, TX, USA, June 05, 2023 (GLOBE NEWSWIRE) -- Custom Market Insights has published a new research report titled Advanced Driver Assistance Systems (ADAS) Market Size, Trends and Insights By Syst… [+23294 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Investopedia"
    },
    "author": "Staff Author",
    "title": "Sales of Tesla EVs Made in China Soar",
    "description": "Sales of Tesla EVs made in China soared in May and were up 142% from the same period in 2022, when COVID-19 restrictions limited production.",
    "url": "https://www.investopedia.com/sales-of-tesla-evs-made-in-china-soar-7508433",
    "urlToImage": "https://www.investopedia.com/thmb/n4LBONkbvSaHg2Py-eecq3ocOZM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1493214413-08d7ffa26aba408799bd03296d09ce9c.jpg",
    "publishedAt": "2023-06-05T20:26:40Z",
    "content": "<ul><li>Sales of Tesla EVs made in China soared in May and were up 142% from the same period in 2022.</li><li>COVID-19 restrictions had limited Tesla production in 2022.</li><li>The sales report came… [+1112 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "thestreet.com",
    "title": "Elon Musk Dismisses GM's Autonomous Vehicles",
    "description": "Elon Musk has often said that he aims to help Tesla's rivals promote the adoption of electric vehicles and achieve a sustainable energy economy. With this in mind, Tesla (TSLA) - Get Free Report will open its network of superchargers to owners of Ford Mustang…",
    "url": "https://biztoc.com/x/ed6f89108c378e40",
    "urlToImage": "https://c.biztoc.com/p/ed6f89108c378e40/s.webp",
    "publishedAt": "2023-06-05T20:13:23Z",
    "content": "Elon Musk has often said that he aims to help Tesla's rivals promote the adoption of electric vehicles and achieve a sustainable energy economy. With this in mind, Tesla (TSLA) - Get Free Report will… [+290 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "barrons.com",
    "title": "Want More Affordable EVs? End the Protectionism",
    "description": "About the author: Christopher Tang is a distinguished professor at the UCLA Anderson School of Management. With nearly $2 trillion in federal funding behind its industrial policy, the Biden administration should be finding it relatively easy to achieve its go…",
    "url": "https://biztoc.com/x/a30350f22d8d429d",
    "urlToImage": "https://c.biztoc.com/p/a30350f22d8d429d/s.webp",
    "publishedAt": "2023-06-05T20:12:46Z",
    "content": "About the author: Christopher Tang is a distinguished professor at the UCLA Anderson School of Management.With nearly $2 trillion in federal funding behind its industrial policy, the Biden administra… [+301 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Barron's"
    },
    "author": "Christopher Tang",
    "title": "Want More Affordable EVs? End the Protectionism.",
    "description": "The Biden has ambitious goals for electric vehicles. Its rules about who can get tax credits are holding those back, writes Christopher Tang.",
    "url": "https://www.barrons.com/articles/affordable-evs-tax-credit-rules-f6a4b029",
    "urlToImage": "https://images.barrons.com/im-793196/social",
    "publishedAt": "2023-06-05T20:10:13Z",
    "content": "About the author: Christopher Tang is a distinguished professor at the UCLA Anderson School of Management. With nearly $2 trillion in federal funding behind its industrial policy, the Biden administr… [+6165 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Forbes"
    },
    "author": "Derek Saul, Forbes Staff, \n Derek Saul, Forbes Staff\n https://www.forbes.com/sites/dereksaul/",
    "title": "Apple Stock Hits All-Time High—Then Falls After Revealing $3,500 Price Tag For AI Headset",
    "description": "Shares of the iPhone maker are still up more than 1,000% over the last decade.",
    "url": "https://www.forbes.com/sites/dereksaul/2023/06/05/apple-stock-hits-all-time-high-then-falls-after-revealing-3500-price-tag-for-ai-headset/",
    "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/647de9e5afdb3d5a430e1090/0x0.jpg?format=jpg&crop=4003,2249,x0,y0,safe&width=1200",
    "publishedAt": "2023-06-05T20:03:43Z",
    "content": "Apple shares hit their highest price in the stocks 43-year history early Monday ahead of the debut of its mixed reality Vision Pro headset, though the stock then slid after the tech giant announced a… [+3001 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "MarketScreener",
    "title": "5.06.2023 Alpine Select Ltd.: Monthly Update May",
    "description": "(marketscreener.com) \n \n \n Monthly Report - May 2023\n \n \n \n \n \n Market commentary\n \n \n It was like 'Groundhog Day', this time May 2023. The US Congressional debt ceiling debates had the markets, the media, and the public concerned about the ability of the US …",
    "url": "https://www.marketscreener.com/quote/stock/ALPINE-SELECT-AG-142221/news/5-06-2023-Alpine-Select-Ltd-Monthly-Update-May-44042793/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "publishedAt": "2023-06-05T20:03:04Z",
    "content": "Market commentary\r\nIt was like 'Groundhog Day', this time May 2023. The US Congressional debt ceiling debates had the markets, the media, and the public concerned about the ability of the US to pay i… [+2584 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Marketscreener.com"
    },
    "author": "Reuters",
    "title": "S&P 500 ends lower as traders eye potential pause in rate hikes",
    "description": "(marketscreener.com) The S&P 500 ended lower on Monday as\ninvestors weighed whether the U.S. Federal Reserve might pause\nits interest rate hikes at its upcoming policy meeting, while\nApple briefly hit a record high before losing ground.\n Apple Inc ended lower…",
    "url": "https://www.marketscreener.com/quote/index/S-P-500-4985/news/S-P-500-ends-lower-as-traders-eye-potential-pause-in-rate-hikes-44038393/?utm_medium=RSS&utm_content=20230605",
    "urlToImage": "https://img.zonebourse.com/reuters/2023-06/2023-06-01T140609Z_1_LYNXMPEJ501K5_RTROPTP_3_USA-STOCKS.JPG",
    "publishedAt": "2023-06-05T20:02:11Z",
    "content": "(For a Reuters live blog on U.S., UK and European stock\r\nmarkets, click or type LIVE/ in a news window.)\r\n* Palo Alto Networks gains on S&amp;P 500 index inclusion\r\n* Apple hits record high ahead of … [+2777 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "New York Post"
    },
    "author": "Ariel Zilber",
    "title": "Elon Musk predicts class-action lawsuits against Target after company loses $15 billion",
    "description": "\"Won’t be long before there are class-action lawsuits by shareholders against the company and board of directors...,\" Musk tweeted.",
    "url": "https://nypost.com/2023/06/05/elon-musk-predicts-class-action-lawsuits-against-target/",
    "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/newspress-collage-27351525-1685991499096.jpg?quality=75&strip=all&1685977177&w=1024",
    "publishedAt": "2023-06-05T19:59:12Z",
    "content": "Elon Musk expects retail giant Target to be hit with class-action lawsuits from investors after the value of the company sunk more than $15 billion since the chain’s controversial “PRIDE” collection … [+3050 chars]"
    },
    {
    "source": {
    "id": "rt",
    "name": "RT"
    },
    "author": "RT",
    "title": "Instagram un-bans US presidential candidate",
    "description": "Meta has reversed its ban of Robert F. Kennedy Junior’s personal Instagram account, but has yet to let him register a campaign one Read Full Article at RT.com",
    "url": "https://www.rt.com/news/577538-instagram-unbans-rfk-meta/",
    "urlToImage": "https://mf.b37mrtl.ru/files/2023.06/article/647e3a8785f54017556de5a7.jpg",
    "publishedAt": "2023-06-05T19:53:14Z",
    "content": "Robert F. Kenedy Jr.’s personal Instagram account was reinstated over the weekend, after the Democrat seeking to challenge President Joe Biden in the party primaries complained that the platform woul… [+2465 chars]"
    }
    ]
    }